; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-4-265)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p5-0 - location
	p5-3 - location
	p2-1 - location
	p2-3 - location
	p2-4 - location
	p1-0 - location
	p1-4 - location
	p1-5 - location
	p1-6 - location
	p0-3 - location
	p4-0 - location
	p4-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s1)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s3)
	(at package2 s1)
	(at package3 s6)
	(at package4 s6)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 26)
	(= (time-to-walk p5-0 s5) 26)
	(= (time-to-walk s0 p5-0) 1)
	(= (time-to-walk p5-0 s0) 1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 43)
	(= (time-to-walk p5-3 s5) 43)
	(= (time-to-walk s3 p5-3) 7)
	(= (time-to-walk p5-3 s3) 7)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 47)
	(= (time-to-walk p2-1 s2) 47)
	(= (time-to-walk s1 p2-1) 29)
	(= (time-to-walk p2-1 s1) 29)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 44)
	(= (time-to-walk p2-3 s2) 44)
	(= (time-to-walk s3 p2-3) 30)
	(= (time-to-walk p2-3 s3) 30)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 12)
	(= (time-to-walk p2-4 s2) 12)
	(= (time-to-walk s4 p2-4) 8)
	(= (time-to-walk p2-4 s4) 8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 33)
	(= (time-to-walk p1-0 s1) 33)
	(= (time-to-walk s0 p1-0) 13)
	(= (time-to-walk p1-0 s0) 13)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 34)
	(= (time-to-walk p1-4 s1) 34)
	(= (time-to-walk s4 p1-4) 24)
	(= (time-to-walk p1-4 s4) 24)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 16)
	(= (time-to-walk p1-5 s1) 16)
	(= (time-to-walk s5 p1-5) 30)
	(= (time-to-walk p1-5 s5) 30)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 60)
	(= (time-to-walk p1-6 s1) 60)
	(= (time-to-walk s6 p1-6) 44)
	(= (time-to-walk p1-6 s6) 44)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 42)
	(= (time-to-walk p0-3 s0) 42)
	(= (time-to-walk s3 p0-3) 14)
	(= (time-to-walk p0-3 s3) 14)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 21)
	(= (time-to-walk p4-0 s4) 21)
	(= (time-to-walk s0 p4-0) 2)
	(= (time-to-walk p4-0 s0) 2)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 36)
	(= (time-to-walk p4-5 s4) 36)
	(= (time-to-walk s5 p4-5) 27)
	(= (time-to-walk p4-5 s5) 27)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 55)
	(= (time-to-drive s0 s4) 55)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 40)
	(= (time-to-drive s3 s4) 40)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 48)
	(= (time-to-drive s5 s4) 48)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 46)
	(= (time-to-drive s0 s2) 46)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 18)
	(= (time-to-drive s1 s2) 18)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 24)
	(= (time-to-drive s3 s2) 24)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 50)
	(= (time-to-drive s4 s2) 50)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 59)
	(= (time-to-drive s4 s1) 59)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 54)
	(= (time-to-drive s1 s6) 54)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 48)
	(= (time-to-drive s2 s6) 48)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 61)
	(= (time-to-drive s5 s6) 61)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 19)
	(= (time-to-drive s1 s5) 19)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 56)
	(= (time-to-drive s2 s5) 56)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 32)
	(= (time-to-drive s1 s0) 32)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 15)
	(= (time-to-drive s5 s0) 15)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 39)
	(= (time-to-drive s6 s0) 39)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 47)
	(= (time-to-drive s0 s3) 47)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 20)
	(= (time-to-drive s1 s3) 20)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 31)
	(= (time-to-drive s5 s3) 31)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s5)
	(at driver3 s3)
	(at driver4 s6)
	(at truck1 s5)
	(at truck2 s1)
	(at truck3 s2)
	(at package1 s6)
	(at package2 s1)
	(at package3 s0)
	(at package4 s3)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver2 s1 p1-5)
   deleted: (at driver2 s1)
   added: (at driver2 p1-5)
   goals met: 1 of 10
2. (walk driver2 p1-5 s5)
   deleted: (at driver2 p1-5)
   added: (at driver2 s5)
   goals met: 2 of 10
3. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 10
4. (walk driver4 s1 p1-6)
   deleted: (at driver4 s1)
   added: (at driver4 p1-6)
   goals met: 2 of 10
5. (walk driver4 p1-6 s6)
   deleted: (at driver4 p1-6)
   added: (at driver4 s6)
   goals met: 3 of 10
6. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 0 to 180
   goals met: 4 of 10
7. (load-truck package3 truck3 s6)
   deleted: (at package3 s6)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 10
8. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 3 of 10
9. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 2 of 10
10. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   goals met: 2 of 10
11. (drive-truck truck3 s6 s2 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 180 to 708
   goals met: 3 of 10
12. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 10
13. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 708 to 1188
   goals met: 4 of 10
14. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 5 of 10
15. (drive-truck truck3 s2 s0 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 1188 to 1694
   goals met: 4 of 10
16. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 10
17. (drive-truck truck3 s0 s2 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 1694 to 2154
   goals met: 6 of 10
18. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 2154 to 2354
   goals met: 5 of 10
19. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 6 of 10
20. (drive-truck truck3 s2 s6 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 2354 to 2834
   goals met: 5 of 10
21. (load-truck package4 truck3 s6)
   deleted: (at package4 s6)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 10
22. (drive-truck truck3 s6 s2 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 2834 to 3362
   goals met: 6 of 10
23. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 3362 to 3626
   goals met: 5 of 10
24. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 10
25. (drive-truck truck3 s3 s2 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 3626 to 3938
   goals met: 6 of 10
26. (drive-truck truck3 s2 s6 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 3938 to 4562
   goals met: 5 of 10
27. (unload-truck package1 truck3 s6)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 6 of 10
28. (drive-truck truck3 s6 s2 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 4562 to 5090
   goals met: 7 of 10
29. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 5090 to 5354
   goals met: 6 of 10
30. (unload-truck package4 truck3 s3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 10
31. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 6 of 10
32. (disembark-truck driver4 truck3 s3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 6 of 10
33. (disembark-truck driver3 truck2 s3)
   deleted: (driving driver3 truck2)
   added: (at driver3 s3) (empty truck2)
   goals met: 7 of 10
34. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
35. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 5354 to 5594
   goals met: 7 of 10
36. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 7 of 10
37. (walk driver3 s2 p2-3)
   deleted: (at driver3 s2)
   added: (at driver3 p2-3)
   goals met: 7 of 10
38. (walk driver3 p2-3 s3)
   deleted: (at driver3 p2-3)
   added: (at driver3 s3)
   goals met: 8 of 10
39. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 10
40. (drive-truck truck2 s3 s1 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 5594 to 5794
   goals met: 8 of 10
41. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 8 of 10
42. (walk driver4 s3 p5-3)
   deleted: (at driver4 s3)
   added: (at driver4 p5-3)
   goals met: 8 of 10
43. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 10
44. (walk driver4 p5-3 s5)
   deleted: (at driver4 p5-3)
   added: (at driver4 s5)
   goals met: 8 of 10
45. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 5794 to 5994
   goals met: 7 of 10
46. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 5994 to 6234
   goals met: 7 of 10
47. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 7 of 10
48. (walk driver3 s2 p2-3)
   deleted: (at driver3 s2)
   added: (at driver3 p2-3)
   goals met: 7 of 10
49. (walk driver3 p2-3 s3)
   deleted: (at driver3 p2-3)
   added: (at driver3 s3)
   goals met: 8 of 10
50. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 8 of 10
51. (drive-truck truck2 s2 s5 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 6234 to 6794
   goals met: 8 of 10
52. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 10
53. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 7 of 10
54. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 8 of 10
55. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 10
56. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 6794 to 6984
   goals met: 8 of 10
57. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 8 of 10
58. (walk driver2 s1 p1-5)
   deleted: (at driver2 s1)
   added: (at driver2 p1-5)
   goals met: 8 of 10
59. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 10
60. (walk driver2 p1-5 s5)
   deleted: (at driver2 p1-5)
   added: (at driver2 s5)
   goals met: 9 of 10
61. (drive-truck truck1 s5 s6 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (fuel-used) from 6984 to 7594
   goals met: 8 of 10
62. (disembark-truck driver1 truck1 s6)
   deleted: (driving driver1 truck1)
   added: (at driver1 s6) (empty truck1)
   goals met: 8 of 10
63. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 8 of 10
64. (board-truck driver1 truck1 s6)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 10
65. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 7594 to 8204
   goals met: 9 of 10
66. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 9 of 10
67. (walk driver4 s1 p1-6)
   deleted: (at driver4 s1)
   added: (at driver4 p1-6)
   goals met: 9 of 10
68. (walk driver4 p1-6 s6)
   deleted: (at driver4 p1-6)
   added: (at driver4 s6)
   goals met: 10 of 10
